[
    {
        "titulo": "Mark Zuckerberg is reportedly taking advice on political decisions, including how the company handles political ads, from Trump adviser and Facebook board member Peter Thiel", 
        "texto": "Peter Thiel, a longtime Facebook board member and adviser to President Donald Trump, has been advising Facebook CEO Mark Zuckerberg on political matters, including the company's decision not to fact-check political ads, according to a new report from The Wall Street Journal.\nZuckerberg, Thiel, and President Trump also shared a private dinner together in October, but the details of the meeting haven't been disclosed.\nThiel's political stances may have put him at odds with other board members and Facebook staff members, and the company continues to face scrutiny as the 2020 election approaches.\nVisit Business Insider's homepage for more stories.\nLongtime Facebook board member Peter Thiel's role as an advisor to the Trump administration could be influencing Facebook's political policy decisions, including the company's decision not to fact-check political ads.\nFacebook CEO Mark Zuckerberg says the policy is in support of free speech, but according to a new report from The Wall Street Journal, the position has become a point of contention among Facebook staff, several of whom have disagreed with Thiel's political stances.\nFacebook has come under scrutiny for its decision to allow political ads with false or intentionally misleading information to be published without being fact-checked. Other types of advertisements are subject to a third-party fact checking process that can result in a warning label for false information.\nDemocratic presidential candidates have specifically criticized Facebook for letting President Donald Trump's campaign publish ads that reference previously debunked conspiracy theories. Republicans have not taken issue with Facebook's position; however multiple GOP leaders have accused Facebook and other tech companies of acting with a political bias and censoring conservative voices with their moderation practices in the past.\nIn a string of public appearances in October, Zuckerberg said Facebook doesn't want to be the arbiter of truth in political conversations. Thiel, one of Facebook's earliest investors, is backing Zuckerberg's approach; but Thiel's personal politics may have caused tension between Facebook's board members.\nThiel joined Zuckerberg for a private dinner with President Donald Trump in October, and in August Thiel called for the FBI and CIA to investigate Google's artificial intelligence research in China, calling the project \"seemingly treasonous.\"\nThe Journal reported that Netflix CEO Reed Hastings and former White House chief of staff Erskine Bowles both had disagreements with Thiel before leaving Facebook's board earlier this year. Former lead independent director Sue Desmond-Hellmann also left the board at the end of October and Facebook has yet to hire a replacement. The report also said that Thiel, who has been on Facebook's board since 2004, was starting to exert more power in the company with Facebook's leadership in flux.\nShortly after Zuckerberg publicly announced Facebook's position on political ads, Twitter CEO Jack Dorsey announced that Twitter would no longer accept political ads at all. In a series of tweets announcing his decision, Dorsey said it wasn't realistic for Twitter to fully commit to stopping people from spreading misleading info while also allowing paid political advertisers to post freely.\nFacebook employees have also expressed concern that the decision to allow political ads without fact-checking runs directly counter to their efforts to stop misinformation from spreading on the platform. In October, 250 Facebook employees signed a joint letter asking the social media platform to change its policy with a list of recommendations on how to improve the fact-checking process."
    }
]