[
    {
        "titulo": "Google fired an engineer who built a tool that notified employees of their labor rights. She's the 5th employee this month to accuse the company of illegal retaliation.", 
        "texto": "Google has fired an engineer who built a tool that notified employees of their labor rights when they visited certain websites.\nKathryn Spiers modified a security tool to display additional notifications and was dismissed last week.\nWith the help of the CWA union, she has filed a charge with the NLRB, alleging Google illegally fired her for engaging in protected activity.\nGoogle said she \"abused privileged access to modify an internal security tool,\" calling her actions \"a serious violation.\" The firm said it did not fire her for trying to inform colleagues of their rights.\nClick here for more BI Prime stories.\nA former Google engineer has filed a complaint against her former employer with the National Labor Relations Board (NLRB) after she was terminated for building a tool that automatically reminded other Google employees of their rights when they visited certain websites.\nKathryn Spiers, a former security engineer at the California search giant, had modified a feature in the employee-only version of the web browser Chrome that displayed a pop-up notification telling employees that they \"have the right to participate in protected concerted activities\" when they visited the website of a labor-consulting firm hired by Google and some other websites.\nThe tool was originally designed to present Google employees with security-related notifications as they browse the web, and Google suspended Spiers within hours of her change. She was subsequently fired over what the company said was a violation of its policy.\nOn Monday, the Communications Workers of America union filed a charge with the NLRB, a US federal agency overseeing labor issues, alleging that Spiers' dismissal was illegal retaliation for engaging in protected activity, according to a copy of the complaint shared with Business Insider.\nIn a statement, a Google spokesperson defended the firing: \"We dismissed an employee who abused privileged access to modify an internal security tool. This was a serious violation.\"\nGoogle has been racked with labor issues for months, with activist employees staging protests and walkouts over numerous issues, from payouts made to executives accused of sexual harassment to the company's now shelved plans to build a censored search engine to operate in China.\nIn November, it fired four employees — who have become known as the \"Thanksgiving Four\" — for what it said were violations of its data-security policies. They alleged they were retaliated against for trying to organize workers. \nIn an interview, Spiers said she believed she was also retaliated against for trying to inform Google employees of their rights.\nGoogle has denied this and said the issue wasn't Spiers' messaging but the fact she altered a privacy and security tool without permission.\nGoogle reached a settlement with the NLRB in September after a complaint last year from another employee. One of the requirements of the settlement was that Google share with employees a list of their rights. \"Google is a nontraditional company ... posting a notice in the cafeteria isn't an effective way of notifying vast amounts of our organization\" about their rights, Spiers said of the notification tool she created.\n\"I think I was participating in protected concerted activity, and I think I'm being retaliated against for my labor organizing,\" she said. \"And then it is worth noting that in ... the course of events, they fired five people for organizing. And three of us have been trans women. That is not representative of Google's population as a whole. It is not representative of the organizers of Google. It is statistically significant.\"\nSpiers, alongside other employees, also worked on a tool that notified the top Google lawyer Kent Walker whenever a user accessed any internal documents, in a protest against greater restrictions on what employees at the historically open company can access. The existence of the tool was first reported by Bloomberg last week.\nDo you work at Google? Contact this reporter via encrypted messaging app Signal at (+1) 650-636-6268 using a nonwork device, email at rprice@businessinsider.com, Telegram or WeChat at robaeprice, or Twitter DM at @robaeprice. (PR pitches by email only, please.)"
    }, 
    {
        "titulo": "Huawei's next major P40 flagship phone will reportedly launch in March 2020 without any Google apps", 
        "texto": "Huawei's next major flagship phone, the Huawei P40, will reportedly arrive in March 2020 without Google's mobile services.\nHuawei consumer boss Richard Yu told French tech publication Frandroid that the Chinese tech firm will launch the P40 in Paris next year.\nThe phone will run Huawei's alternative app store and accompanying services, known as Huawei Mobile Services, but won't come with Google's Play Store or Google's most popular apps.\nHuawei has been unable to license full-fat Android with accompanying Google services thanks to the ongoing US-China trade war.\nVisit Business Insider's homepage for more stories.\nHuawei's next major flagship phone and iPhone killer, the P40, will reportedly arrive in March 2020 without any Google services.\nThat's according to an interview given by Huawei executive Richard Yu to French tech publication Frandroid. We saw the news via Mashable.\nAccording to Frandroid, the Huawei P40 will launch in Paris in March 2020, in keeping with the firm's usual timeline for updates to its high-end P series of phones.\nYu doesn't explicitly state that the P40 won't run Google services, but does say the phone will come equipped with Huawei Mobile Services, which is effectively a replacement.\nGoogle Mobile Services is the term for Google's licensed suite of services to accompany the Android OS.\nIt includes the Play Store, some of Google's most popular apps, and accompanying APIs to help functionality.\nAlthough Android is free for mobile manufacturers to install on devices, they pay an additional fee to layer Google Mobile Services on top. Most popular Android phones come equipped with this extra Google software, and it's why many phones come with Gmail, YouTube, Maps, and other core apps.\nBut that licensed, full-fat version of Android has been unavailable to Huawei since May this year thanks to a US trade ban.\nIn September, Huawei launched its first high-end Android phone without Google services, the Mate 30. At that launch, Yu appealed to developers to build apps for its ecosystem.\nAfter the Mate 30, the P40 will be Huawei's second flagship lacking Google services.\nSeparately, Huawei is working on an alternative underlying mobile operating system to Android, called HarmonyOS. Yu told Frandroid that the new OS won't be ready in time for the P40. Instead, the firm will run on Android 10 — just the version without Google apps."
    }, 
    {
        "titulo": "Google's former HR boss shared the company's 4 rules for hiring the best employees", 
        "texto": "Former Google HR boss Laszlo Bock outlined Google's foundational approach to management in his book \"Work Rules!\"\nGoogle's, and later Alphabet's, detail-oriented approach to hiring is a primary reason for how it became one of the world's most successful companies.\nBock's approach to hiring prioritizes setting uncompromising high standards and making the process inclusive of each candidate's potential colleagues.\nClick here for more BI Prime stories.\nEach year, Google receives more than 2 million job applications from around the world. They hire a few thousand. \nSo what can you expect if you apply to work there?\nA timeline of about six weeks. You're going to be screened by your future boss, colleagues, and a hiring committee. \n\"If you wondered if this takes a lot of Googler time, it does,\" Google's former SVP of People Operations Laszlo Bock wrote in his 2015 book, \"Work Rules!\" Bock worked at Google for 10 years, from 2006 to 2016, and saw the company grow from 6,000 employees to 60,000. His management strategies left a lasting impact on Google, and of course, he's had a front-row seat to changes in the hiring process as he watched the company grow tenfold.\nBock wrote that in the early days of Google, hiring would take four to 10 hours of a manager's time each week, with top executives spending a full day on it. By 2013, the company had slashed that time to one and a half hours a week.\nHe explained that years of research and experimentation helped Google get hiring exceptional people down to a near science. \"There are four simple principles that can help even the smallest team do much, much better at hiring,\" he wrote.\nWe've explained them below."
    }
]